Repository: carmenalexander/pelican
Catalog: docs/locales/*/LC_MESSAGES/faq.po
Languages: es_es

source: Frequently Asked Questions (FAQ)
es_es: Preguntas frecuentes

source: Here are some frequently asked questions about Pelican.
es_es: Aquí hay algunas preguntas frecuentes sobre Pelican.

source: What's the best way to communicate a problem, question, or suggestion?
es_es: ¿Cuál es la mejor forma de comunicar un problema, una pregunta o sugerencia?

source: Please read our :doc:`feedback guidelines <contribute>`.
es_es: Por favor lee nuestras :doc:`directrices de «feedback» <contribute>`.

source: How can I help?
es_es: ¿Cómo puedo ayudar?

source: There are several ways to help out. First, you can communicate any Pelican suggestions or problems you might have via `Pelican Discussions <https://github.com/getpelican/pelican/discussions>`_. Please first check the existing list of discussions and issues (both open and closed) in order to avoid submitting topics that have already been covered before.
es_es: Hay varias maneras de ayudar. Primero, puedes comunicar cualquier sugerencias o problemas de Pelican que tengas mediante `Pelican Discussions <https://github.com/getpelican/pelican/discussions>`_. Por favor, primero comprueba la lista existente de discusiones y problemas (tanto abiertos como cerrados) para evitar enviar temas que hayan sido tratados anteriormente.

source: If you want to contribute, please fork `the git repository <https://github.com/getpelican/pelican/>`_, create a new feature branch, make your changes, and issue a pull request. Someone will review your changes as soon as possible. Please refer to the :doc:`How to Contribute <contribute>` section for more details.
es_es: Si quieres contribuir, por favor, haz un *fork* `del repositorio Git <https://github.com/getpelican/pelican/>`_, crea una nueva rama para la funcionalidad, haz los cambios y crea un *pull request*. Alguien revisará tus cambios tan pronto como sea posible. Consulta la sección :doc:`How to Contribute <contribute>` para más detalles.

source: You can also contribute by creating themes and improving the documentation.
es_es: También puedes contribuir creando temas y mejorando la documentación.

source: Is the Pelican settings file mandatory?
es_es: ¿Es obligatorio el archivo de ajustes de Pelican?

source: Configuration files are optional and are just an easy way to configure Pelican. For basic operations, it's possible to specify options while invoking Pelican via the command line. See ``pelican --help`` for more information.
es_es: Los archivos de configuración son opcionales y son simplemente una manera sencilla de configurar Pelican. Para operaciones básicas, es posible especificar opciones mientras llamas a Pelican por la línea de comandos. Consulta ``pelican --help`` para más información.

source: Changes to the settings file take no effect
es_es: Los cambios al archivo de configuración no hacen nada

source: When experimenting with different settings (especially the metadata ones) caching may interfere and the changes may not be visible. In such cases, ensure that caching is disabled via ``LOAD_CONTENT_CACHE = False`` or use the ``--ignore-cache`` command-line switch.
es_es: Al probar con diferentes ajustes (especialmente los de metadatos), el almacenamiento en caché podría interferir y los cambios podrían no ser visibles. En esos casos, asegúrate de que el almacenamiento en caché está desactivado mediante ``LOAD_CONTENT_CACHE = False`` o usa el argumento ``--ignore-cache``.

source: I'm creating my own theme. How do I use Pygments for syntax highlighting?
es_es: Estoy creando mi propio tema. ¿Cómo uso Pygments para el resaltado de sintaxis?

source: Pygments adds some classes to the generated content. These classes are used by themes to style code syntax highlighting via CSS. Specifically, you can customize the appearance of your syntax highlighting via the ``.highlight pre`` class in your theme's CSS file. To see how various styles can be used to render Django code, for example, use the style selector drop-down at top-right on the `Pygments project demo site <https://pygments.org/demo/>`_.
es_es: Pygments añade algunas clases al contenido generado. Estas clases son usadas por los temas para dar estilo al resaltado de sintaxis de código mediante CSS. En concreto, puedes personalizar la apariencia de tu resaltado de sintaxis mediante la clase ``.highlight pre`` en el archivo CSS de tu tema. Para ver cómo se pueden usar estilos diferentes para representar gráficamente código de Django, por ejemplo, usa el menú desplegable del selector de estilo situado en la parte superior derecho del `sitio de demostración del proyecto Pygments <https://pygments.org/demo/>`_.

source: You can use the following example commands to generate a starting CSS file from a Pygments built-in style (in this case, "monokai") and then copy the generated CSS file to your new theme::
es_es: Puedes usar los siguientes comandos de ejemplo para generar un archivo CSS inicial a partir del estilo incorporado en Pygments (en este caso «monokai») y luego copiar el archivo CSS generado a tu nuevo tema::

source: Don't forget to import your ``pygment.css`` file from your main CSS file.
es_es: No te olvides de importar tu archivo ``pygment.css`` desde tu principal archivo CSS.

source: How do I create my own theme?
es_es: ¿Cómo creo mi propio tema?

source: Please refer to :ref:`theming-pelican`.
es_es: Por favor, consulta :ref:`theming-pelican`.

source: I want to use Markdown, but I got an error.
es_es: Quiero usar Markdown, pero obtengo un error.

source: If you try to generate Markdown content without first installing the Markdown library, may see a message that says ``No valid files found in content``. Markdown is not a hard dependency for Pelican, so if you have content in Markdown format, you will need to explicitly install the Markdown library. You can do so by typing the following command, prepending ``sudo`` if permissions require it::
es_es: Si intentas generar contenido Markdown sin antes instalar la biblioteca Markdown, puede que vea un mensaje que dice ``No valid files found in content``. Markdown no es estrictamente una dependencia de Pelican, así que si tienes contenido en formato Markdown, tendrás que instalar la biblioteca Markdown. Puedes hacerlo escribiendo el siguiente comando, anteponiendo ``sudo`` si se requieren permisos::

source: Can I use arbitrary metadata in my templates?
es_es: ¿Puedo usar metadatos arbitrarios en mis plantillas?

source: Yes. For example, to include a modified date in a Markdown post, one could include the following at the top of the article::
es_es: Sí. Por ejemplo, para incluir una fecha modificada en una publicación de Markdown, se podría incluir lo siguiente en la parte superior del artículo::

source: For reStructuredText, this metadata should of course be prefixed with a colon::
es_es: Por supuesto, para reStructuredText estos metadatos deben ir precedidos de dos puntos::

source: This metadata can then be accessed in templates such as ``article.html`` via::
es_es: Se puede acceder a estos metadatos en plantillas como ``article.html`` mediante::

source: If you want to include metadata in templates outside the article context (e.g., ``base.html``), the ``if`` statement should instead be::
es_es: Si quieres incluir metadatos en plantillas fuera del contexto del artículo (p. ej., ``base.html``), el código de ``ìf`` debe ser::

source: How do I assign custom templates on a per-page basis?
es_es: ¿Cómo asigno plantillas personalizadas en función de la página?

source: It's as simple as adding an extra line of metadata to any page or article that you want to have its own template. For example, this is how it would be handled for content in reST format::
es_es: Es tan simple como añadir una línea extra de metadato a cualquier página o artículo que quieras que tenga su propia plantilla. Por ejemplo, así es cómo se haría para contenido en formato reST::

source: For content in Markdown format::
es_es: Para contenido en formato Markdown::

source: Then just make sure your theme contains the relevant template file (e.g. ``template_name.html``).
es_es: Luego simplemente asegúrate de que tu tema contiene el archivo de plantilla relevante (p. ej., ``template_name.html``).

source: How can I override the generated URL of a specific page or article?
es_es: ¿Cómo puedo sobrescribir la URL generada para una página o artículo en concreto?

source: Include ``url`` and ``save_as`` metadata in any pages or articles that you want to override the generated URL. Here is an example page in reST format::
es_es: Incluye los metadatos ``url`` y ``save_as`` en las páginas o artículos en las que quieras sobrescribir la URL generada. Aquí hay una página de ejemplo en formato reST::

source: With this metadata, the page will be written to ``override/url/index.html`` and Pelican will use url ``override/url/`` to link to this page.
es_es: Con estos metadatos, la página será escrita en ``override/url/index.html`` y Pelican usará la URL ``override/url/`` para enlazar a esta página.

source: How can I use a static page as my home page?
es_es: ¿Cómo puedo usar una página estática como mi página de inicio?

source: The override feature mentioned above can be used to specify a static page as your home page. The following Markdown example could be stored in ``content/pages/home.md``::
es_es: La funcionalidad de sobrescritura mencionada anteriormente puede ser usada para especificar una página estática como tu página de inicio. El siguiente ejemplo de Markdown se podría guardar en ``content/pages/home.md``::

source: If the original blog index is still wanted, it can then be saved in a different location by setting ``INDEX_SAVE_AS = 'blog_index.html'`` for the ``'index'`` direct template.
es_es: Si aún quieres tener el *index* original del blog, puede guardarse en una ubicación diferente asignando ``INDEX_SAVE_AS = 'blog_index.html'`` para la plantilla directa ``index``.

source: What if I want to disable feed generation?
es_es: ¿Y si quiero desactivar la generación de fuente web?

source: To disable feed generation, all feed settings should be set to ``None``. All but three feed settings already default to ``None``, so if you want to disable all feed generation, you only need to specify the following settings::
es_es: Para desactivar la generación de fuente web, todos los ajustes de fuente web deben ponerse en ``None``. Todos los ajustes de fuente web ya están por defecto en ``None``, así que si deseas desactivar toda la generación de fuente web, solo tienes que especificar los siguientes ajustes::

source: The word ``None`` should not be surrounded by quotes. Please note that ``None`` and ``''`` are not the same thing.
es_es: La palabra ``None`` no debe ser rodeada por comillas. Ten en cuenta que ``None`` y ``''`` no son lo mismo.

source: I'm getting a warning about feeds generated without SITEURL being set properly
es_es: Me sale una advertencia de que las fuentes web generadas sin SITEURL ajustado correctamente

source: `RSS and Atom feeds require all URL links to be absolute <https://validator.w3.org/feed/docs/rss2.html#comments>`_. In order to properly generate links in Pelican you will need to set ``SITEURL`` to the full path of your site.
es_es: `Las fuentes web de RSS y Atom requieren que todos los enlaces sean absolutos <https://validator.w3.org/feed/docs/rss2.html#comments>`_. Para generar enlaces correctamente en Pelican tendrás que poner en ``SITEURL`` la ruta absoluta de tu sitio web.

source: Feeds are still generated when this warning is displayed, but links within may be malformed and thus the feed may not validate.
es_es: Las fuentes web aún se generan cuando se muestra esta advertencia, pero los enlaces en ellas podrían ser incorrectos, y, por tanto, la fuente web podría no ser válida.

source: Can I force Atom feeds to show only summaries instead of article content?
es_es: ¿Puedo hacer que las fuentes de Atom solo muestren resúmenes en vez de contenido de artículos?

source: Instead of having to open a separate browser window to read articles, the overwhelming majority of folks who use feed readers prefer to read content within the feed reader itself. Mainly for that reason, Pelican does not support restricting Atom feeds to only contain summaries. Unlike Atom feeds, the RSS feed specification does not include a separate ``content`` field, so by default Pelican publishes RSS feeds that only contain summaries (but can optionally be set to instead publish full content RSS feeds). So the default feed generation behavior provides users with a choice: subscribe to Atom feeds for full content or to RSS feeds for just the summaries.
es_es: En lugar de tener que abrir una ventana separada del navegador para leer artículos, la inmensa mayoría de la gente que utiliza lectores de fuentes web prefiere leer el contenido dentro del propio lector de fuentes. Principalmente por esa razón, Pelican no permite restringir los canales Atom para que solo contengan resúmenes. A diferencia de las fuentes Atom, la especificación de fuentes RSS no incluye un campo ``content`` separado, por lo que Pelican publica por defecto fuentes RSS que solo contienen resúmenes (pero opcionalmente se pueden configurar para publicar en su lugar fuentes RSS de contenido completo). Por lo tanto, el comportamiento predeterminado de generación de fuentes ofrece a los usuarios una opción: suscribirse a fuentes Atom para el contenido completo o a fuentes RSS solo para los resúmenes.

source: Is Pelican only suitable for blogs?
es_es: ¿Pelican solo sirve para blogs?

source: No. Pelican can be easily configured to create and maintain any type of static site. This may require a little customization of your theme and Pelican configuration. For example, if you are building a launch site for your product and do not need tags on your site, you could remove the relevant HTML code from your theme. You can also disable generation of tag-related pages via::
es_es: No. Pelican puede configurarse fácilmente para crear y mantener cualquier tipo de sitio web estático. Esto puede requerir una pequeña personalización de tu tema y de tu configuración de Pelican. Por ejemplo, si estás creando un sitio web de presentación para tu producto y no necesitas etiquetas en en él, podrías eliminar el código HTML correspondiente de tu tema. También puedes desactivar la generación de páginas asociadas a etiquetas mediante::

source: Why does Pelican always write all HTML files even with content caching enabled?
es_es: ¿Por qué Pelican escribe siempre todos los archivos HTML incluso con la caché de contenido habilitada?

source: In order to reliably determine whether the HTML output is different before writing it, a large part of the generation environment including the template contexts, imported plugins, etc. would have to be saved and compared, at least in the form of a hash (which would require special handling of unhashable types), because of all the possible combinations of plugins, pagination, etc. which may change in many different ways. This would require a lot more processing time and memory and storage space. Simply writing the files each time is a lot faster and a lot more reliable.
es_es: Para determinar de forma fiable si la salida de HTML es diferente antes de escribirla, habría que guardar y comparar una gran parte del entorno de generación, incluidos los contextos de las plantillas, las extensiones exportadas, etc., tendría que ser guardada y comparada, al menos en forma de *hash* (lo que requeriría un manejo especial de las cosas no *hasheables*), debido a todas las posibles combinaciones de extensiones, paginación, etc., que podrían cambiar de muchas formas diferentes. Esto requeriría mucho más tiempo de procesamiento y espacio de memoria y almacenamiento. Simplemente escribir los archivos cada vez es mucho más rápido y fiable.

source: However, this means that the modification time of the files changes every time, so a ``rsync`` based upload will transfer them even if their content hasn't changed. A simple solution is to make ``rsync`` use the ``--checksum`` option, which will make it compare the file checksums in a much faster way than Pelican would.
es_es: Sin embargo, esto significa que el tiempo de modificación de los ficheros cambia cada vez, por lo que una subida basada en ``rsync`` los transferirá incluso si su contenido no ha cambiado. Una solución sencilla es hacer que ``rsync`` use la opción ``--checksum``, que hará que compare las sumas de comprobación de los archivos de una forma mucho más rápida que si lo hiciera Pelican.

source: When only several specific output files are of interest (e.g. when working on some specific page or the theme templates), the ``WRITE_SELECTED`` option may help, see :ref:`writing_only_selected_content`.
es_es: Cuando solo son de interés algunos archivos de salida concretos (p. ej., cuando se trabaja en alguna página específica o en las plantillas del tema), la opción ``ẀRITE_SELECTED`` puede ser útil, consulta :ref:`writing_only_selected_content`.

source: How to process only a subset of all articles?
es_es: ¿Cómo procesar solo un subconjunto de todos los artículos?

source: It is often useful to process only e.g. 10 articles for debugging purposes. This can be achieved by explicitly specifying only the filenames of those articles in ``ARTICLE_PATHS``. A list of such filenames could be found using a command similar to ``cd content; find -name '*.md' | head -n 10``.
es_es: A menudo resulta útil procesar solo 10 artículos, por ejemplo, con fines de depuración. Esto se puede realizar especificando explícitamente solo los nombres de archivo de esos artículos en ``ARTICLE_PATHS``. Se podría obtener una lista de esos nombres de archivo usando un comando como ``cd content; find -name '*.md' | head -n 10``.

source: My tag-cloud is missing/broken since I upgraded Pelican
es_es: Desde que actualicé Pelican falta/está rota mi nube de etiquetas

source: In an ongoing effort to streamline Pelican, tag cloud generation has been moved out of Pelican core and into a separate `plugin <https://github.com/pelican-plugins/tag-cloud>`_. See the :ref:`plugins` documentation for further information about the Pelican plugin system.
es_es: En un esfuerzo continuo por optimizar Pelican, la generación de la nube de etiquetas se ha trasladado del núcleo de Pelican a un `complemento <https://github.com/pelican-plugins/tag-cloud>`_ separado. Consulta la documentación de :ref:`plugins` para más información sobre el sistema de complementos de Pelican.

source: Since I upgraded Pelican my pages are no longer rendered
es_es: Desde que actualicé Pelican mis páginas no se procesan

source: Pages were available to themes as lowercase ``pages`` and uppercase ``PAGES``. To bring this inline with the :ref:`templates-variables` section, ``PAGES`` has been removed. This is quickly resolved by updating your theme to iterate over ``pages`` instead of ``PAGES``. Just replace::
es_es: Las páginas estaban disponibles en los temas como ``pages`` (en minúscula) y ``PAGES`` (en mayúscula). Para ajustar esto a la sección :ref:`templates-variables`, se eliminó ``PAGES``. Esto se arregla fácilmente actualizando tu tema para iterar en ``pages`` en vez de en ``PAGES``. Simplemente reemplaza::

source: with something like::
es_es: por algo como::

source: How can I stop Pelican from trying to parse my static files as content?
es_es: ¿Cómo puedo evitar que Pelican intente procesar mis archivos estáticos como contenido?

source: Pelican's article and page generators run before it's static generator. That means if you use a setup similar to the default configuration, where a static source directory is defined inside a ``*_PATHS`` setting, all files that have a valid content file ending (``.html``, ``.rst``, ``.md``, ...) will be treated as articles or pages before they get treated as static files.
es_es: Los generadores de artículos y páginas de Pelican se ejecutan antes que el generador estático. Esto significa que si usas una configuración similar a la predeterminada, en la que se define un directorio fuente estático dentro de un ajuste ``*_PATHS``, todos los archivos que tengan una extensión de archivo válida (``.html``, ``.rst``, ``.md``, ...) serán tratados como artículos o páginas antes de ser tratados como archivos estáticos.

source: To circumvent this issue either use the appropriate ``*_EXCLUDES`` setting or disable the offending reader via ``READERS`` if you don't need it.
es_es: Para evitar este problema, utiliza la configuración ``*_EXCLUDES`` adecuada o desactiva el lector problemático mediante ``READERS`` si no lo necesitas.

source: Why is [arbitrary Markdown syntax] not supported?
es_es: ¿Por qué no está soportado [sintaxis de Markdown x]?

source: Pelican does not directly handle Markdown processing and instead delegates that task to the Python-Markdown_ project, the core of which purposefully follows the original Markdown syntax rules and not the myriad Markdown "flavors" that have subsequently propagated. That said, Python-Markdown_ is quite modular, and the syntax you are looking for may be provided by one of the many available `Markdown Extensions`_. Alternatively, some folks have created Pelican plugins that support Markdown variants, so that may be your best choice if there is a particular variant you want to use when writing your content.
es_es: Pelican no maneja directamente el procesamiento de Markdown y en su lugar delega esa tarea al proyecto Python-Markdown_, cuyo núcleo sigue deliberadamente las reglas sintácticas originales de Markdown y no la miríada de «sabores» de Markdown que se han extendido posteriormente. Dicho esto, Python-Markdown_ es bastante modular, y la sintaxis que estás buscando puede ser proporcionada por una de las muchas `Extensiones de Markdown`_ disponibles. Alternativamente, algunas personas han creado extensiones de Pelican que soportan variantes de Markdown, así que esto podría ser tu mejor opción si hay una variante particular que deseas utilizar al escribir tu contenido.
