Repository: carmenalexander/pelican
Catalog: docs/locales/*/LC_MESSAGES/index.po
Languages: es_es

source: Pelican is a static site generator, written in Python_. Highlights include:
es_es: Pelican es un generador de sitios web estáticos, escrito en Python_. Estas son algunas de sus funcionalidades destacadas:

source: Write your content directly with your editor of choice in reStructuredText_ or Markdown_ formats
es_es: Escribe tu contenido directamente con el editor que quieras en los formatos reStructuredText_ o Markdown_

source: Includes a simple CLI tool to (re)generate your site
es_es: Incluye una herramienta de terminal para (re)generar tu sitio

source: Easy to interface with distributed version control systems and web hooks
es_es: Fácil de usar con sistemas de control de versiones distribuidos y *web hooks*

source: Completely static output is easy to host anywhere
es_es: El contenido completamente estático es fácil de alojar en cualquier sitio

source: Ready to get started? Check out the :doc:`Quickstart<quickstart>` guide.
es_es: ¿Listo para comenzar? Echa un vistazo a la guía :doc:`Comienzo rápido<quickstart>`

source: Features
es_es: Funcionalidades

source: Pelican’s feature highlights include:
es_es: Las características destacadas de Pelican incluyen:

source: Articles (e.g., blog posts) and pages (e.g., "About", "Projects", "Contact")
es_es: Artículos (p. ej., entradas de blogs) y páginas (p. ej. «Sobre», «Proyectos», «Contacto»)

source: Integration with external services
es_es: Integración con servicios externos

source: Site themes (created using Jinja2_ templates)
es_es: Temas de sitio web (creados usando plantillas Jinja2_)

source: Publication of articles in multiple languages
es_es: Publicación de artículos en múltiples idiomas

source: Generation of Atom and RSS feeds
es_es: Generación de fuentes Atom y RSS

source: Code syntax highlighting
es_es: Resaltado de sintaxis de código

source: Import existing content from WordPress, Dotclear, or RSS feeds
es_es: Importar contenido existente de WordPress, Dotclear o fuentes RSS

source: Fast rebuild times thanks to content caching and selective output writing
es_es: Tiempos de regeneración rápidos gracias al cacheo de contenido y escritura selectiva de salida

source: Extensible via a rich plugin ecosystem: `Pelican Plugins`_
es_es: Extensible mediante un rico ecosistema de extensiones: `Pelican Plugins`_

source: Why the name "Pelican"?
es_es: ¿Por qué el nombre «Pelican»?

source: "Pelican" is an anagram for *calepin*, which means "notebook" in French. ;)
es_es: «Pelican» es un anagrama para *calepin*, que significa «libreta» en francés. ;)

source: Source code
es_es: Código fuente

source: You can access the source code at: https://github.com/getpelican/pelican
es_es: Puedes acceder al código fuente en https://github.com/getpelican/pelican

source: How to get help, contribute, or provide feedback
es_es: Cómo ayudar, contribuir o dar *feedback*

source: See our :doc:`feedback and contribution submission guidelines <contribute>`.
es_es: Lee nuestras :doc:`directrices para el envío de *feedback* y contribuciones <contribute>`.

source: Documentation
es_es: Documentación
