Repository: carmenalexander/pelican
Catalog: docs/locales/*/LC_MESSAGES/install.po
Languages: es_es

source: Installing Pelican
es_es: Instalar Pelican

source: Pelican currently runs best on 3.7+; earlier versions of Python are not supported.
es_es: Pelican actualmente funciona mejor en 3.7+; no están soportadas versiones anteriores.

source: You can install Pelican via several different methods. The simplest is via Pip_::
es_es: Puedes instalar Pelican de varias formas. La más simple es con Pip_::

source: Or, if you plan on using Markdown::
es_es: O, si piensas utilizar Markdown::

source: (Keep in mind that some operating systems will require you to prefix the above command with ``sudo`` in order to install Pelican system-wide.)
es_es: (Ten en cuenta que algunos sistemas operativos requieren que prefijes el anterior comando con ``sudo`` para instalar Pelican en todo el sistema.)

source: While the above is the simplest method, the recommended approach is to create a virtual environment for Pelican via virtualenv_ before installing Pelican. Assuming you have virtualenv_ installed, you can then open a new terminal session and create a new virtual environment for Pelican::
es_es: Aunque el anterior es el método más simple, el método recomendado es crear un entorno virtual para Pelican mediante virtualenv_ antes de instalar Pelican. Asumiendo que tienes virtualenv_ instalado, puedes abrir una sesión de terminal y crear un nuevo entorno virtual para Pelican::

source: Once the virtual environment has been created and activated, Pelican can be installed via ``python -m pip install pelican`` as noted above. Alternatively, if you have the project source, you can install Pelican using the distutils method::
es_es: Una vez se haya creado y activado el entorno virtual, se podrá instalar Pelican mediante ``python -m pip install pelican`` como se indicó anteriormente. Alternativamente, si tienes el código fuente del proyecto, puedes instalar Pelican usando el método de ``distutils``::

source: If you have Git installed and prefer to install the latest bleeding-edge version of Pelican rather than a stable release, use the following command::
es_es: Si tienes Git instalado y prefieres instalar la ultimísima versión de Pelican en vez de una versión estable, usa el siguiente comando::

source: Once Pelican is installed, you can run ``pelican --help`` to see basic usage options. For more detail, refer to the :doc:`Publish<publish>` section.
es_es: Una vez que Pelican esté instalado, puedes ejecutar ``pelican --help`` para ver opciones básicas de uso. Para más detalle consulta la sección :doc:`Publicar<publish>`.

source: Optional packages
es_es: Paquetes opcionales

source: If you plan on using `Markdown <https://pypi.org/project/Markdown/>`_ as a markup format, you can install Pelican with Markdown support::
es_es: Si piensas usar `Markdown <https://pypi.org/project/Markdown/>`_ como formato de marcado, puedes instalar Pelican con soporte para Markdown::

source: Typographical enhancements can be enabled in your settings file, but first the requisite `Typogrify <https://pypi.org/project/typogrify/>`_ library must be installed::
es_es: Se pueden habilitar mejoras tipográficas en tu archivo de ajustes, pero primero la biblioteca requerida Typogrify <https://pypi.org/project/typogrify/>`_ debe ser instalada::

source: Dependencies
es_es: Dependencias

source: When Pelican is installed, the following dependent Python packages should be automatically installed without any action on your part:
es_es: Cuando se instale Pelican, los siguientes paquetes Python dependientes deberían de instalarse automáticamente sin ninguna acción por tu parte:

source: `feedgenerator <https://pypi.org/project/feedgenerator/>`_, to generate the Atom feeds
es_es: `feedgenerator <https://pypi.org/project/feedgenerator/>`_, para generar las fuentes Atom

source: `jinja2 <https://pypi.org/project/Jinja2/>`_, for templating support
es_es: `jinja2 <https://pypi.org/project/Jinja2/>`_, para soporte de plantillas

source: `pygments <https://pypi.org/project/Pygments/>`_, for syntax highlighting
es_es: `pygments <https://pypi.org/project/Pygments/>`_, para resaltado de sintaxis

source: `docutils <https://pypi.org/project/docutils/>`_, for supporting reStructuredText as an input format
es_es: `docutils <https://pypi.org/project/docutils/>`_, para permitir reStructuredText como formato de entrada

source: `pytz <https://pypi.org/project/pytz/>`_, for timezone definitions
es_es: `pytz <https://pypi.org/project/pytz/>`_, para definiciones de zona horaria

source: `blinker <https://pypi.org/project/blinker/>`_, an object-to-object and broadcast signaling system
es_es: `blinker <https://pypi.org/project/blinker/>`_, como un sistema de señalización *broadcast* y objeto a objeto

source: `unidecode <https://pypi.org/project/Unidecode/>`_, for ASCII transliterations of Unicode text utilities
es_es: `unidecode <https://pypi.org/project/Unidecode/>`_, para herramientas de transliteraciones ASCII de texto Unicode

source: `MarkupSafe <https://pypi.org/project/MarkupSafe/>`_, for a markup-safe string implementation
es_es: `MarkupSafe <https://pypi.org/project/MarkupSafe/>`_, para una implementación de cadenas de marcado segura

source: `python-dateutil <https://pypi.org/project/python-dateutil/>`_, to read the date metadata
es_es: `python-dateutil <https://pypi.org/project/python-dateutil/>`_, para leer los metadatos de fecha

source: Upgrading
es_es: Actualizar

source: If you installed a stable Pelican release via Pip_ and wish to upgrade to the latest stable release, you can do so by adding ``--upgrade``::
es_es: Si instalaste una publicación de Pelican estable mediante Pip_ y te gustaría actualizar a la última publicación estable, puedes hacerlo añadiendo ``--upgrade``::

source: If you installed Pelican via distutils or the bleeding-edge method, simply perform the same step to install the most recent version.
es_es: Si instalaste Pelican mediante ``distutils`` o el método de la ultimísima versión, simplemente haz lo mismo que hiciste para instalar la versión más reciente.

source: Kickstart your site
es_es: Poner en marcha tu sitio web

source: Once Pelican has been installed, you can create a skeleton project via the ``pelican-quickstart`` command, which begins by asking some questions about your site::
es_es: Una vez que Pelican haya sido instalado, puedes crear un proyecto de base mediante el comando ``pelican-quickstart``, que comienza preguntando algunas preguntas sobre tu sitio web::

source: If run inside an activated virtual environment, ``pelican-quickstart`` will look for an associated project path inside ``$VIRTUAL_ENV/.project``. If that file exists and contains a valid directory path, the new Pelican project will be saved at that location. Otherwise, the default is the current working directory. To set the new project path on initial invocation, use: ``pelican-quickstart --path /your/desired/directory``
es_es: Si lo ejecutas dentro de un entorno virtual activado, ``pelican-quickstart`` buscará una ruta de proyecto asociada dentro de ``$VIRTUAL_ENV/.project``. Si ese archivo existe y contiene una ruta de directorio válida, el nuevo proyecto de Pelican será guardado en esa ubicación. De lo contrario, la predeterminada es el directorio de trabajo actual. Para asignar la nueva ruta del proyecto en la llamada inicial usa ``pelican-quickstart --path /tu/directorio/deseado``

source: Once you finish answering all the questions, your project will consist of the following hierarchy (except for *pages* — shown in parentheses below — which you can optionally add yourself if you plan to create non-chronological content)::
es_es: Una vez que termines de responder a todas las preguntas, tu proyecto constará de la siguiente jerarquía (excepto para **pages** —montrado abajo en paréntesis— , que puedes añadir por ti mismo opcionalmente si tienes previsto crear contenido no cronológico)::

source: The next step is to begin to adding content to the *content* folder that has been created for you.
es_es: El siguiente paso es empezar a añadir contenido a la carpeta *content* que ha sido creada para ti.
