Repository: carmenalexander/pelican
Catalog: docs/locales/*/LC_MESSAGES/pelican-themes.po
Languages: es_es

source: Description
es_es: Descripción

source: ``pelican-themes`` is a command line tool for managing themes for Pelican. See :ref:`settings/themes` for settings related to themes.
es_es: ``pelican-themes`` es una herramienta de línea de comandos para gestionar temas de Pelican. Consulta :ref:`settings/themes` para ajustes relacionados con temas.

source: Usage
es_es: Uso

source: pelican-themes [-h] [-l] [-i theme path [theme path ...]]
es_es: pelican-themes [-h] [-l] [-i ruta del tema [ruta del tema ...]]

source: [-r theme name [theme name ...]]
es_es: [-r nombre del tema [nombre del tema ...]]

source: [-s theme path [theme path ...]] [-v] [--version]
es_es: [-s ruta del tema [ruta del tema ...]] [-v] [--version]

source: Optional arguments:
es_es: Argumentos opcionales:

source: Show the help an exit
es_es: Muestra la ayuda y sale

source: Show the themes already installed
es_es: Muestra los temas ya instalados

source: One or more themes to install
es_es: Uno o más temas a instalar

source: One or more themes to remove
es_es: Uno o más temas a eliminar

source: Same as "--install", but create a symbolic link instead of copying the theme. Useful for theme development
es_es: Igual que ``--install``, pero crea un enlace simbólico en vez de copiar el tema. Útil para el desarrollo de temas

source: Verbose output
es_es: Salida verbosa

source: Print the version of this script
es_es: Imprime la versión de este *script*

source: Examples
es_es: Ejemplos

source: Listing the installed themes
es_es: Listar los temas instalados

source: With ``pelican-themes``, you can see the available themes by using the ``-l`` or ``--list`` option:
es_es: Con ``pelican-themes``, puedes ver los temas disponibles usando la opción ``-l`` o ``--list``:

source: In this example, we can see there are three themes available: ``notmyidea``, ``simple``, and ``two-column``.
es_es: En este ejemplo, podemos ver que hay tres temas disponibles: ``notmyidea``, ``simple`` y ``two-column``.

source: ``two-column`` is followed by an ``@`` because this theme is not copied to the Pelican theme path, but is instead just linked to it (see `Creating symbolic links`_ for details about creating symbolic links).
es_es: ``two-column`` va seguido de una ``@`` porque este tema no está copiado en la ruta de temas de Pelican, sino que en vez de eso simplemente está enlazado a esta (consulta `Creating symbolic links`_ para detalles sobre creación de enlaces simbólicos).

source: Note that you can combine the ``--list`` option with the ``-v`` or ``--verbose`` option to get more verbose output, like this:
es_es: Ten en cuenta que puedes combinar la opción ``--list`` con la opción ``-v`` o ``--verbose`` para obtener una salida más verbosa, como esta:

source: Installing themes
es_es: Instalar temas

source: You can install one or more themes using the ``-i`` or ``--install`` option. This option takes as argument the path(s) of the theme(s) you want to install, and can be combined with the verbose option:
es_es: Puedes instalar uno o más temas usando la opción ``-i`` o ``--install``. Esta opción toma como argumento la(s) ruta(s) de el/los tema(s) que quieres instalar y puede combinarse con la opción ``--verbose``:

source: Removing themes
es_es: Eliminar temas

source: The ``pelican-themes`` command can also remove themes from the Pelican themes path. The ``-r`` or ``--remove`` option takes as argument the name(s) of the theme(s) you want to remove, and can be combined with the ``--verbose`` option.
es_es: El comando ``pelican-themes`` también puede eliminar temas de la ruta de temas de Pelican. La opción ``-r`` o ``--remove`` toma como argumento el/los nombre(s) del/de los tema(s) que quieres eliminar y puede combinarse con la opción ``--verbose``.

source: Creating symbolic links
es_es: Crear enlaces simbólicos

source: ``pelican-themes`` can also install themes by creating symbolic links instead of copying entire themes into the Pelican themes path.
es_es: ``pelican-themes`` también puede instalar temas creando enlaces simbólicos en vez de copiar los temas enteros a la ruta de temas de Pelican.

source: To symbolically link a theme, you can use the ``-s`` or ``--symlink``, which works exactly as the ``--install`` option:
es_es: Para enlazar simbólicamente a un tema puedes usar ``-s`` o ``--symlink```, que funciona exactamente igual que la opción ``--install``:

source: In this example, the ``two-column`` theme is now symbolically linked to the Pelican themes path, so we can use it, but we can also modify it without having to reinstall it after each modification.
es_es: En este ejemplo, el tema ``two-column`` es ahora enlazado simbólicamente a la ruta de temas de Pelican, así que podemos usarlo, pero también modificarlo sin tener que reinstalarlo después de cada modificación.

source: This is useful for theme development:
es_es: Esto es útil para el desarrollo de temas:

source: Doing several things at once
es_es: Hacer varias cosas de golpe

source: The ``--install``, ``--remove`` and ``--symlink`` option are not mutually exclusive, so you can combine them in the same command line to do more than one operation at time, like this:
es_es: Las opciones ``--install``, ``--remove`` y ``--symlink`` no se excluyen mutuamente, así que puedes combinarlas en la misma línea de comandos para hacer más de una operación de golpe, así:

source: In this example, the theme ``notmyidea-cms`` is replaced by the theme ``notmyidea-cms-fr``
es_es: En este ejemplo, el tema ``notmyidea-cms`` se reemplaza por el tema ``notmyidea-cms-fr``
