Repository: carmenalexander/pelican
Catalog: docs/locales/*/LC_MESSAGES/quickstart.po
Languages: es_es

source: Quickstart
es_es: Comienzo rápido

source: Reading through all the documentation is highly recommended, but for the truly impatient, following are some quick steps to get started.
es_es: Se recomienda encarecidamente leer toda la documentación, pero para los verdaderamente impacientes, a continuación se indican algunos pasos rápidos para empezar.

source: Installation
es_es: Instalación

source: Install Pelican (and optionally Markdown if you intend to use it) on Python 3.6+ by running the following command in your preferred terminal, prefixing with ``sudo`` if permissions warrant::
es_es: Instala Pelican (y opcionalmente Markdown si tienes la intención de usarlo) en Python 3.6+ ejecutando el siguiente comando en tu terminal preferida, prefijándolo con ``sudo`` si los permisos lo permiten::

source: Create a project
es_es: Crear un proyecto

source: First, choose a name for your project, create an appropriately-named directory for your site, and switch to that directory::
es_es: Primero escoge un nombre para tu proyecto, crea un directorio con un nombre apropiado para tu sitio y ve a ese directorio::

source: Create a skeleton project via the ``pelican-quickstart`` command, which begins by asking some questions about your site::
es_es: Crea un proyecto base con el comando ``pelican-quickstart``, que comienza preguntando algunas preguntas sobre tu sitio::

source: For questions that have default values denoted in brackets, feel free to use the Return key to accept those default values [#tzlocal_fn]_. When asked for your URL prefix, enter your domain name as indicated (e.g., ``https://example.com``).
es_es: Para preguntas que tienen valores predeterminados indicados entre paréntesis, no dudes en utilizar la tecla Entrar para aceptar esos valores predeterminados [#tzlocal_fn]_. Cuando se te pregunte sobre tu prefijo de URL introduce tu nombre de dominio como se indica (p. ej., ``https://ejemplo.com``).

source: Create an article
es_es: Crear un artículo

source: You cannot run Pelican until you have created some content. Use your preferred text editor to create your first article with the following content::
es_es: No puedes ejecutar Pelican hasta que hayas creado algún contenido. Usa tu editor de texto preferido para crear tu primer artículo con el siguiente contenido::

source: Given that this example article is in Markdown format, save it as ``~/projects/yoursite/content/keyboard-review.md``.
es_es: Dado que este artículo de ejemplo está en formato Markdown, guárdalo como ``~/projects/yoursite/content/keyboard-review.md``.

source: Generate your site
es_es: Generar tu sitio web

source: From your project root directory, run the ``pelican`` command to generate your site::
es_es: Desde el directorio raíz de tu proyecto, ejecuta el comando ``pelican`` para generar tu sitio::

source: Your site has now been generated inside the ``output/`` directory. (You may see a warning related to feeds, but that is normal when developing locally and can be ignored for now.)
es_es: Ahora tu sitio se ha generado dentro del directorio ``output/``. (Puede que veas una advertencia relacionada con fuentes Atom o RSS, pero eso es normal cuando se desarrolla localmente y puede ignorarse por ahora.)

source: Preview your site
es_es: Previsualizar tu sitio web

source: Open a new terminal session, navigate to your project root directory, and run the following command to launch Pelican's web server::
es_es: Abre una nueva sesión de terminal, navega al directorio raíz de tu proyecto y ejecuta el siguiente comando para iniciar el servidor web de Pelican::

source: Preview your site by navigating to http://localhost:8000/ in your browser.
es_es: Previsualiza tu sitio web navegando a http://localhost:8000/ en tu navegador.

source: Continue reading the other documentation sections for more detail, and check out the Pelican wiki's Tutorials_ page for links to community-published tutorials.
es_es: Sigue leyendo las demás secciones de documentación para más detalles y échale un vistazo a la página de **wiki** de Pelican Tutorials_ para ver tutoriales publicados por la comunidad.

source: Footnotes
es_es: Notas a pie de página

source: You can help localize default fields by installing the optional `tzlocal <https://pypi.org/project/tzlocal/>`_ module.
es_es: Puedes ayudar a localizar campos predeterminados instalando el módulo opcional `tzlocal <https://pypi.org/project/tzlocal/>`_.
